/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_convert_base.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By:  ctokoyod < ctokoyod@student.42tokyo.jp    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/08/27 21:41:23 by  ctokoyod         #+#    #+#             */
/*   Updated: 2023/08/27 21:47:26 by  ctokoyod        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
• nbr文字列を、base_from進数からbase_to進数へ変換した文字列を返す関数を
作成せよ。
• nbr、base_from、base_toに、書き込みはできない。
• nbrは、 ft_atoi_base と同じルールが適用される。 C 07モジュールを参照
し、“+”、“-”、空白の扱いに気をつけること。
• nbrは、intに格納されること。
• ベースにエラーがある場合は、NULLを返すこと。
• 空白や“+”を、戻り値の前に入れないこと。必要な場合は、“-”を1つのみ入
れること。
*/


char *ft_convert_base(char *nbr, char *base_from, char *base_to)
{

	
}

int main(void)
{
	int nbr;
	
}